package com.wrh.meteo.component.enums;

import lombok.AllArgsConstructor;

/**
 * @author wrh
 * @version 1.0
 * @date 2021/2/23 11:26
 * @describe 中国各省份信息枚举(包括CCCC码, 行政区码, 省份名称, 简称, 以及经纬度范围)
 */

@AllArgsConstructor
public enum ProInfoEnum {

    CCCC("100000", "中国", "中国", 70, 0, 140, 60),
    BCUQ("650000", "新疆维吾尔自治区", "新疆维", 73.35f, 34.2f, 96.5f, 49.3f),
    BELS("540000", "西藏自治区", "西藏", 78.25f, 26.75f, 99.25f, 36.7f),
    BEXN("630000", "青海省", "青海", 89.3f, 31.4f, 102.95f, 39.4f),
    BCLZ("620000", "甘肃省", "甘肃", 92.2f, 32.45f, 108.85f, 42.9f),
    BEHT("150000", "内蒙古自治区", "内蒙古", 97.2f, 37.3f, 126.2f, 53.45f),
    BEYC("640000", "宁夏回族自治区", "宁夏", 104.15f, 35.1f, 107.8f, 39.5f),
    BEXA("610000", "陕西省", "陕西", 105.35f, 31.6f, 111.35f, 39.7f),
    BCCD("510000", "四川省", "四川", 97.25f, 26.1f, 108.65f, 34.45f),
    BECQ("500000", "重庆市", "重庆", 105.15f, 28.05f, 110.3f, 32.35f),
    BEGY("520000", "贵州省", "贵州", 103.45f, 24.5f, 109.7f, 29.35f),
    BEKM("530000", "云南省", "云南", 97.4f, 21f, 106.3f, 29.4f),
    BENN("450000", "广西壮族自治区", "广西", 104.35f, 21.25f, 112.2f, 26.5f),
    BCGZ("440000", "广东省", "广东", 108.95f, 20.1f, 117.45f, 25.65f),
    BECS("430000", "湖南省", "湖南", 108.65f, 24.5f, 114.4f, 30.25f),
    BENC("360000", "江西省", "江西", 113.45f, 24.35f, 118.6f, 30.2f),
    BCWH("420000", "湖北省", "湖北", 108.25f, 28.9f, 116.25f, 33.4f),
    BEZZ("410000", "河南省", "河南", 110.2f, 31.25f, 116.75f, 36.5f),
    BEHF("340000", "安徽省", "安徽", 114.75f, 29.25f, 119.75f, 34.8f),
    BETY("140000", "山西省", "山西", 110.1f, 34.45f, 114.65f, 40.85f),
    BESZ("130000", "河北省", "河北", 113.35f, 35.9f, 119.95f, 42.75f),
    BEPK("110000", "北京市", "北京", 115.3f, 39.3f, 117.6f, 41.2f),
    BETJ("120000", "天津市", "天津", 116.6f, 38.4f, 118.2f, 40.35f),
    BEHB("230000", "黑龙江省", "黑龙江", 121.05f, 43.3f, 135.2f, 53.7f),
    BECC("220000", "吉林省", "吉林", 121.5f, 40.7f, 131.45f, 46.45f),
    BCSY("210000", "辽宁省", "辽宁", 118.7f, 38.6f, 125.9f, 43.6f),
    BEJN("370000", "山东省", "山东", 114.65f, 34.25f, 122.8f, 38.55f),
    BENJ("320000", "江苏省", "江苏", 116.2f, 30.65f, 122f, 35.25f),
    BCSH("310000", "上海市", "上海", 120.75f, 30.55f, 122f, 31.95f),
    BEHZ("330000", "浙江省", "浙江", 117.9f, 26.9f, 123.05f, 31.3f),
    BEFZ("350000", "福建省", "福建", 115.7f, 23.4f, 120.85f, 28.45f),
    BEHK("460000", "海南省", "海南", 108.5f, 3.7f, 117.95f, 21.25f),
    ;
    private final String adminCode;
    private final String name;
    private final String shortName;
    private final float startLon;
    private final float startLat;
    private final float endLon;
    private final float endLat;
}
